# St7SetReactionMultiPointLinkAttributes

Assigns attributes to a reaction multi-point link.

long St7SetReactionMultiPointLinkAttributes(long uID, long LinkNum, long SetNum,

double* Origin)

Input Parameters

uID

Strand7 model file ID.

LinkNum

Link number.

SetNum

Element set number defining the entities that contribute to the reaction multi-point link cluster.

Link Attributes – Set

Origin[0..2]

Origin position in global XYZ coordinates.

Strand7 API Manual

Link Attributes – Get